In [3]:
import pandas as pd
import numpy as np

# Data Transformation in Pandas

In [1]:
classes={"Tim":"A","Tom":"A","Sam":"B",
         "Kate":"B","Kim":"B"}

In [8]:
new_class = pd.DataFrame(list(classes.items()))
# new_class = pd.DataFrame([classes])
new_class

      0  1
0   Tim  A
1   Tom  A
2   Sam  B
3  Kate  B
4   Kim  B

In [11]:
studentData = { 
0 : {
    'name' : 'Aadi',
    'age' : 16,
    'city' : 'New york'
    },
1 : {
    'name' : 'Jack',
    'age' : 34,
    'city' : 'Sydney'
    },
2 : {
    'name' : 'Riti',
    'age' : 30,
    'city' : 'Delhi'
    }
}

new_df = pd.DataFrame(studentData)
new_df.T

   name age      city
0  Aadi  16  New york
1  Jack  34    Sydney
2  Riti  30     Delhi

In [15]:
df=pd.DataFrame({"names":["Tim","tom","Sam",
                          "kate","Kim"],
                "scores":[60,50,70,80,40]})
df

  names  scores
0   Tim      60
1   tom      50
2   Sam      70
3  kate      80
4   Kim      40

In [16]:
n=df["names"].str.capitalize()
n

0     Tim
1     Tom
2     Sam
3    Kate
4     Kim
Name: names, dtype: object

### map()

- Dictionaries: Pandas will use the .map() method to map items pair-wise, based on a key:vale pair
- Functions: Pandas will apply the function row-wise, evaluating against the row’s value
- Series: Pandas will replace the Series to which the method is applied with the Series that’s passed in

In [17]:
classes

{'Tim': 'A', 'Tom': 'A', 'Sam': 'B', 'Kate': 'B', 'Kim': 'B'}

In [29]:
df["branches"]=n.map(classes)

In [30]:
df

     tim  tom  kim  sam branches
NaN    0    1    2    3      NaN
NaN    4    5    6    7      NaN
NaN    8    9   10   11      NaN

In [31]:
df=pd.DataFrame(
    np.arange(12).reshape(3,4),
    index=[2,4,6],
    columns=["tim","tom","kim","sam"])
df

   tim  tom  kim  sam
2    0    1    2    3
4    4    5    6    7
6    8    9   10   11

In [32]:
s=pd.Series(["one","two", "five","three",'four'])
df.index=df.index.map(s)
df

      tim  tom  kim  sam
five    0    1    2    3
four    4    5    6    7
NaN     8    9   10   11

In [33]:
df=pd.DataFrame(
    np.arange(12).reshape(3,4),
    index=[0,1,2],
    columns=["tim","tom","kim","sam"])
df

   tim  tom  kim  sam
0    0    1    2    3
1    4    5    6    7
2    8    9   10   11

In [34]:
s=pd.Series(["one","two","three",'four'])
df.index=df.index.map(s)
df

       tim  tom  kim  sam
one      0    1    2    3
two      4    5    6    7
three    8    9   10   11

#### rename()

``(index=index_mapper, columns=columns_mapper, ...)``

``(mapper, axis={'index', 'columns'}, ...)``

In [35]:
df.rename(index=str.title,columns=str.upper)

       TIM  TOM  KIM  SAM
One      0    1    2    3
Two      4    5    6    7
Three    8    9   10   11

In [36]:
df.rename(str.upper, axis='index')

       tim  tom  kim  sam
ONE      0    1    2    3
TWO      4    5    6    7
THREE    8    9   10   11

In [16]:
df.rename(index={"one":"ten"},
          columns={"sam":"kate"},
          inplace=True)
df

       tim  tom  kim  kate
ten      0    1    2     3
two      4    5    6     7
three    8    9   10    11

In [17]:
df.rename({"kate":'katty'},
          axis=1,
          inplace=True)
df

       tim  tom  kim  katty
ten      0    1    2      3
two      4    5    6      7
three    8    9   10     11

In [37]:
df.rename({'one': 1, 'two': 2}, axis='index')

       tim  tom  kim  sam
1        0    1    2    3
2        4    5    6    7
three    8    9   10   11

### cut()

do the work of calculating equal-sized bins

In [39]:
import pandas as pd
sc=[20,30,80,40,90,60,45,95,75,55,100,65,85]

In [40]:
x=[20,40,60,80,100,120]

In [41]:
y=pd.cut(sc,x)
y

[NaN, (20.0, 40.0], (60.0, 80.0], (20.0, 40.0], (80.0, 100.0], ..., (60, 80], (40, 60], (80, 100], (60, 80], (80, 100]]
Length: 13
Categories (5, interval[int64, right]): [(20, 40] < (40, 60] < (60, 80] < (80, 100] < (100, 120]]

In [7]:
y.codes # positions of values, i.e to which category it belongs

array([-1,  0,  2,  0,  3,  1,  1,  3,  2,  1,  3,  2,  3], dtype=int8)

In [23]:
y.categories

IntervalIndex([(20, 40], (40, 60], (60, 80], (80, 100]], dtype='interval[int64, right]')

In [24]:
pd.value_counts(y)

(80, 100]    4
(40, 60]     3
(60, 80]     3
(20, 40]     2
dtype: int64

In [8]:
y=pd.cut(sc,x,right=False)
y

[[20, 40), [20, 40), [80, 100), [40, 60), [80, 100), ..., [60, 80), [40, 60), [100, 120), [60, 80), [80, 100)]
Length: 13
Categories (5, interval[int64, left]): [[20, 40) < [40, 60) < [60, 80) < [80, 100) < [100, 120)]

In [12]:
sc=[20,30,80,40,90,60,45,95,75,55,100,65,85]
nm=["low", "medium", "high", "very high","ultra high"] #(20-40]-(40-60]-(60-80]-(80-100]
pd.cut(sc,x,labels=nm)

[NaN, 'low', 'high', 'low', 'very high', ..., 'high', 'medium', 'very high', 'high', 'very high']
Length: 13
Categories (5, object): ['low' < 'medium' < 'high' < 'very high' < 'ultra high']

In [15]:
pd.cut(sc,10)

[(19.92, 28.0], (28.0, 36.0], (76.0, 84.0], (36.0, 44.0], (84.0, 92.0], ..., (68.0, 76.0], (52.0, 60.0], (92.0, 100.0], (60.0, 68.0], (84.0, 92.0]]
Length: 13
Categories (10, interval[float64, right]): [(19.92, 28.0] < (28.0, 36.0] < (36.0, 44.0] < (44.0, 52.0] ... (68.0, 76.0] < (76.0, 84.0] < (84.0, 92.0] < (92.0, 100.0]]

### qcut()

In [27]:
sc=[20,30,80,40,90,60,45,95,75,55,100,65,83]
c=pd.qcut(sc,4)
c
d=pd.cut(sc,4)
d

[(19.92, 40.0], (19.92, 40.0], (60.0, 80.0], (19.92, 40.0], (80.0, 100.0], ..., (60.0, 80.0], (40.0, 60.0], (80.0, 100.0], (60.0, 80.0], (80.0, 100.0]]
Length: 13
Categories (4, interval[float64, right]): [(19.92, 40.0] < (40.0, 60.0] < (60.0, 80.0] < (80.0, 100.0]]

In [28]:
pd.value_counts(c)

(19.999, 45.0]    4
(45.0, 65.0]      3
(65.0, 83.0]      3
(83.0, 100.0]     3
dtype: int64

qcut 

 - the number of elements in each bin will be roughly the same 
 - differently sized interval widths

cut 

 - the bin edges are equal sized (interval widths)
 - uneven number of elements in each bin or group

### take() and sample()

In [30]:
data=pd.DataFrame(
    np.arange(12).reshape(4,3), index=[0, 2, 3, 1])
data

   0   1   2
0  0   1   2
2  3   4   5
3  6   7   8
1  9  10  11

In [31]:
rw=np.random.permutation(4)
rw

array([0, 2, 1, 3])

In [32]:
data.take(rw)

   0   1   2
0  0   1   2
3  6   7   8
2  3   4   5
1  9  10  11

In [33]:
data.sample()

   0  1  2
0  0  1  2

In [34]:
data.sample(n=2)

   0   1   2
3  6   7   8
1  9  10  11

# Hierarchical Indexing in Pandas

In [35]:
data=pd.Series(np.random.randn(9),
               index=[["a","a","a","b","b","b","c","c","d"],
                      [1,2,3,1,2,3,1,2,3]])
data

a  1   -0.393487
   2    0.897557
   3   -0.788836
b  1    1.291795
   2   -0.554070
   3    1.529067
c  1    1.352452
   2    0.003045
d  3   -0.455263
dtype: float64

In [36]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 2),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 3)],
           )

In [37]:
data["a"]

1   -0.393487
2    0.897557
3   -0.788836
dtype: float64

In [38]:
data["b":"c"]

b  1    1.291795
   2   -0.554070
   3    1.529067
c  1    1.352452
   2    0.003045
dtype: float64

In [39]:
data.loc[["a","c"]]

a  1   -0.393487
   2    0.897557
   3   -0.788836
c  1    1.352452
   2    0.003045
dtype: float64

In [40]:
data.loc[:,1]

a   -0.393487
b    1.291795
c    1.352452
dtype: float64

In [51]:
data.unstack(level=0)

          a         b         c         d
1 -0.393487  1.291795  1.352452       NaN
2  0.897557 -0.554070  0.003045       NaN
3 -0.788836  1.529067       NaN -0.455263

In [42]:
data.unstack(level=1)

          1         2         3
a -0.393487  0.897557 -0.788836
b  1.291795 -0.554070  1.529067
c  1.352452  0.003045       NaN
d       NaN       NaN -0.455263

In [43]:
data.unstack().stack()

a  1   -0.393487
   2    0.897557
   3   -0.788836
b  1    1.291795
   2   -0.554070
   3    1.529067
c  1    1.352452
   2    0.003045
d  3   -0.455263
dtype: float64

In [44]:
df=pd.DataFrame(
    np.arange(12).reshape(4,3),
    index=[["a","a","b","b"],
           [1,2,1,2]],
    columns=[["num","num","ver"],
             ["math","stat","geo"]])
df

     num      ver
    math stat geo
a 1    0    1   2
  2    3    4   5
b 1    6    7   8
  2    9   10  11

In [45]:
df.index.names=["class","exam"]
df.columns.names=["field","lesson"]
df

field       num      ver
lesson     math stat geo
class exam
a     1       0    1   2
      2       3    4   5
b     1       6    7   8
      2       9   10  11

In [46]:
df["num"]

lesson      math  stat
class exam
a     1        0     1
      2        3     4
b     1        6     7
      2        9    10

In [47]:
df = df.swaplevel("lesson","field", axis=1)
df

lesson     math stat geo
field       num  num ver
class exam
a     1       0    1   2
      2       3    4   5
b     1       6    7   8
      2       9   10  11

In [48]:
df.loc[:,'num']

KeyError: 'num'

In [ ]:
df['math']

field       num
class exam
a     1       0
      2       3
b     1       6
      2       9

In [ ]:
df.sort_index(level=1)

lesson     math stat geo
field       num  num ver
class exam
a     1       0    1   2
b     1       6    7   8
a     2       3    4   5
b     2       9   10  11

## Summary Statistics by Level

In [ ]:
df.sum(level="exam")

C:\Users\a.mammadov\AppData\Local\Temp\ipykernel_14508\3536528116.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  df.sum(level="exam")

lesson math stat geo
field   num  num ver
exam
1         6    8  10
2        12   14  16

In [ ]:
df.sum(level="field",axis=1)

C:\Users\a.mammadov\AppData\Local\Temp\ipykernel_14508\3947899470.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  df.sum(level="field",axis=1)

field       num  ver
class exam
a     1       1    2
      2       7    5
b     1      13    8
      2      19   11

## Indexing with a DataFrame’s columns

In [ ]:
data=pd.DataFrame(
    {"x":range(8),"y":range(8,0,-1),
     "a":["one","one","one","one","two",
          "two","two","two"],
     "b":[0,1,2,3,0,1,2,3]})
data

   x  y    a  b
0  0  8  one  0
1  1  7  one  1
2  2  6  one  2
3  3  5  one  3
4  4  4  two  0
5  5  3  two  1
6  6  2  two  2
7  7  1  two  3

In [ ]:
data2=data.set_index(["a","b"])
data2

       x  y
a   b
one 0  0  8
    1  1  7
    2  2  6
    3  3  5
two 0  4  4
    1  5  3
    2  6  2
    3  7  1

In [ ]:
data3=data.set_index(["a","b"],drop=False)
data3

       x  y    a  b
a   b
one 0  0  8  one  0
    1  1  7  one  1
    2  2  6  one  2
    3  3  5  one  3
two 0  4  4  two  0
    1  5  3  two  1
    2  6  2  two  2
    3  7  1  two  3

In [ ]:
data2

       x  y
a   b
one 0  0  8
    1  1  7
    2  2  6
    3  3  5
two 0  4  4
    1  5  3
    2  6  2
    3  7  1

In [ ]:
data2.reset_index()

     a  b  x  y
0  one  0  0  8
1  one  1  1  7
2  one  2  2  6
3  one  3  3  5
4  two  0  4  4
5  two  1  5  3
6  two  2  6  2
7  two  3  7  1

In [ ]:
data3.reset_index()

ValueError: cannot insert b, already exists

# Combining & Merging Datasets in Pandas

In [ ]:
import pandas as pd
import numpy as np

## Joining DataFrame

In [37]:
d1=pd.DataFrame(
    {"key":["a","b","c","c","d","e"],
     "num1":range(6)})
d2=pd.DataFrame(
    {"key":["b","c","e","f"],
     "num2":range(4)})

In [ ]:
print(d1)
print(d2)

  key  num1
0   a     0
1   b     1
2   c     2
3   c     3
4   d     4
5   e     5
  key  num2
0   b     0
1   c     1
2   e     2
3   f     3

In [ ]:
pd.merge(d1, d2)

  key  num1  num2
0   b     1     0
1   c     2     1
2   c     3     1
3   e     5     2

In [ ]:
pd.merge(d1, d2, on='key')

  key  num1  num2
0   b     1     0
1   c     2     1
2   c     3     1
3   e     5     2

In [29]:
d3=pd.DataFrame(
    {"key1":["a","b","c","c","d","e"],
     "num1":range(6)})
d4=pd.DataFrame(
    {"key2":["b","c","e","f"],
     "num2":range(4)})

print(d3,'\n',d4)

  key1  num1
0    a     0
1    b     1
2    c     2
3    c     3
4    d     4
5    e     5
   key2  num2
0    b     0
1    c     1
2    e     2
3    f     3

In [35]:
pd.merge(d4,d3,left_on="key2",right_on="key1") # inner

  key2  num2 key1  num1
0    b     0    b     1
1    c     1    c     2
2    c     1    c     3
3    e     2    e     5

In [ ]:
pd.merge(d3,d4,how='left',left_on="key1",right_on="key2") #left

  key1  num1 key2  num2
0    a     0  NaN   NaN
1    b     1    b   0.0
2    c     2    c   1.0
3    c     3    c   1.0
4    d     4  NaN   NaN
5    e     5    e   2.0

In [30]:
pd.merge(d3,d4,how='right',left_on="key1",right_on="key2") #right

  key1  num1 key2  num2
0    b   1.0    b     0
1    c   2.0    c     1
2    c   3.0    c     1
3    e   5.0    e     2
4  NaN   NaN    f     3

  key1  num1
0    a     0
1    b     1
2    c     2
3    c     3
4    d     4
5    e     5 
   key2  num2
0    b     0
1    c     1
2    e     2
3    f     3

In [38]:
pd.merge(d2,d1,how="outer")

  key  num2  num1
0   b   0.0   1.0
1   c   1.0   2.0
2   c   1.0   3.0
3   e   2.0   5.0
4   f   3.0   NaN
5   a   NaN   0.0
6   d   NaN   4.0

In [ ]:
pd.merge(d1,d2,how="left")

  key  num1  num2
0   a     0   NaN
1   b     1   0.0
2   c     2   1.0
3   c     3   1.0
4   d     4   NaN
5   e     5   2.0

In [ ]:
pd.merge(d1,d2,how="right")

  key  num1  num2
0   b   1.0     0
1   c   2.0     1
2   c   3.0     1
3   e   5.0     2
4   f   NaN     3

In [ ]:
pd.merge(d1, d2, how='inner')

  key  num1  num2
0   b     1     0
1   c     2     1
2   c     3     1
3   e     5     2

In [ ]:
df1=pd.DataFrame(
    {"key":["a","b","c","c","d","e"],
     "num1":range(6),
     "count":["one","three","two",
              "one","one","two"]})
df2=pd.DataFrame(
    {"key":["b","c","e","f"],
     "num2":range(4),
     "count":["one","two","two","two"]})

print(df1, '\n', df2)

  key  num1  count
0   a     0    one
1   b     1  three
2   c     2    two
3   c     3    one
4   d     4    one
5   e     5    two
   key  num2 count
0   b     0   one
1   c     1   two
2   e     2   two
3   f     3   two

In [ ]:
pd.merge(df1, df2, on=['key', 'count'], how='right')

  key  num1 count  num2
0   b   NaN   one     0
1   c   2.0   two     1
2   e   5.0   two     2
3   f   NaN   two     3

In [ ]:
pd.merge(df1, df2, on='key', how='right')

  key  num1 count_x  num2 count_y
0   b   1.0   three     0     one
1   c   2.0     two     1     two
2   c   3.0     one     1     two
3   e   5.0     two     2     two
4   f   NaN     NaN     3     two

In [ ]:
pd.merge(df1, df2, 
         on='key', 
         suffixes=('_data1', '_data2'))

  key  num1 count_data1  num2 count_data2
0   b     1       three     0         one
1   c     2         two     1         two
2   c     3         one     1         two
3   e     5         two     2         two

## Merging on index

In [ ]:
df1=pd.DataFrame(
    {"letter":["a","a","b",
               "b","a","c"],
     "num":range(6)}) 
df2=pd.DataFrame(
    {"value":[3,5,7]},
    index=["a","b","e"])

In [ ]:
print(df1)
print(df2)

  letter  num
0      a    0
1      a    1
2      b    2
3      b    3
4      a    4
5      c    5
   value
a      3
b      5
e      7

In [ ]:
pd.merge(df1,df2,
         left_on="letter",
         right_index=True)

  letter  num  value
0      a    0      3
1      a    1      3
4      a    4      3
2      b    2      5
3      b    3      5

In [ ]:
right=pd.DataFrame(
    [[1,2],[3,4],[5,6]],
    index=["a","c","d"],
    columns=["Tom","Tim"])
left=pd.DataFrame(
    [[7,8],[9,10],[11,12],[13,14]],
    index=["a","b","e","f"],
    columns=["Sam","Kim"])

print(left, '\n', right)

   Sam  Kim
a    7    8
b    9   10
e   11   12
f   13   14
    Tom  Tim
a    1    2
c    3    4
d    5    6

In [ ]:
pd.merge(right,left, 
         right_index=True, 
         left_index=True, 
         how="outer")

   Tom  Tim   Sam   Kim
a  1.0  2.0   7.0   8.0
b  NaN  NaN   9.0  10.0
c  3.0  4.0   NaN   NaN
d  5.0  6.0   NaN   NaN
e  NaN  NaN  11.0  12.0
f  NaN  NaN  13.0  14.0

In [ ]:
left.join(right) # left

   Sam  Kim  Tom  Tim
a    7    8  1.0  2.0
b    9   10  NaN  NaN
e   11   12  NaN  NaN
f   13   14  NaN  NaN

In [ ]:
left.join(right,how="inner")

   Sam  Kim  Tom  Tim
a    7    8    1    2

In [ ]:
data=pd.DataFrame([[1,3],[5,7],[9,11]],            
                  index=["a","b","f"],      
                  columns=["Alex","Keta"])
print(left, '\n', right, '\n', data)

   Sam  Kim
a    7    8
b    9   10
e   11   12
f   13   14
    Tom  Tim
a    1    2
c    3    4
d    5    6
    Alex  Keta
a     1     3
b     5     7
f     9    11

In [ ]:
left.join([right,data]) # multiple dataframes at once

    Sam   Kim  Tom  Tim  Alex  Keta
a   7.0   8.0  1.0  2.0   1.0   3.0
b   9.0  10.0  NaN  NaN   5.0   7.0
e  11.0  12.0  NaN  NaN   NaN   NaN
f  13.0  14.0  NaN  NaN   9.0  11.0

## Concatenating Along an Axis

In [ ]:
seq= np.arange(20).reshape((4, 5))

In [ ]:
seq

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19]])

In [ ]:
np.concatenate([seq,seq], axis=1)

array([[ 0,  1,  2,  3,  4,  0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9,  5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14, 10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19, 15, 16, 17, 18, 19]])

In [ ]:
np.concatenate([seq, seq], axis=0)

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19]])

In [ ]:
data1 = pd.Series(
    [0, 1], index=['a', 'b'])
data2 = pd.Series(
    [2,3,4], index=['c','d','e'])
data3 = pd.Series(
    [5, 6], index=['f', 'g'])

print(data1, '\n', data2, '\n', data3)

a    0
b    1
dtype: int64
 c    2
d    3
e    4
dtype: int64
 f    5
g    6
dtype: int64

In [ ]:
pd.concat([data1,data2,data3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [ ]:
pd.concat([data1, data2, data3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [ ]:
data4= pd.Series([10,11,12], 
                 index=['a','b',"c"])
print(data1, '\n', data4)
pd.concat([data1,data4],axis=1,join="inner")

a    0
b    1
dtype: int64
 a    10
b    11
c    12
dtype: int64

   0   1
a  0  10
b  1  11

In [ ]:
print(data1, '\n', data2, '\n', data4)

a    0
b    1
dtype: int64
 c    2
d    3
e    4
dtype: int64
 a    10
b    11
c    12
dtype: int64

In [ ]:
x=pd.concat([data1, data2, data4], 
            keys=['one', 'two','three'])
x

one    a     0
       b     1
two    c     2
       d     3
       e     4
three  a    10
       b    11
       c    12
dtype: int64

In [ ]:
x=pd.concat([data1, data2, data4], 
            axis=1,
            keys=['one', 'two', 'three'])
x

   one  two  three
a  0.0  NaN   10.0
b  1.0  NaN   11.0
c  NaN  2.0   12.0
d  NaN  3.0    NaN
e  NaN  4.0    NaN

In [ ]:
data1 = pd.DataFrame(
    np.random.randn(3, 4),
    columns=['a','b','c','d'])
data2 = pd.DataFrame(
    np.random.randn(2, 3),
    columns=['b','d','a'])

data1

          a         b         c         d
0  0.693950 -0.206157 -2.271447  2.293019
1  0.776002 -0.827163  2.158518  1.139109
2  0.963477  1.406088 -0.304026  0.849619

In [ ]:
data2

          b         d         a
0 -0.498678  0.158885 -1.282099
1  1.014572 -0.319057 -0.587665

In [ ]:
pd.concat([data1, data2], ignore_index=True)

          a         b         c         d
0  0.693950 -0.206157 -2.271447  2.293019
1  0.776002 -0.827163  2.158518  1.139109
2  0.963477  1.406088 -0.304026  0.849619
3 -1.282099 -0.498678       NaN  0.158885
4 -0.587665  1.014572       NaN -0.319057

In [ ]:
pd.concat([data1, data2])

          a         b         c         d
0  0.693950 -0.206157 -2.271447  2.293019
1  0.776002 -0.827163  2.158518  1.139109
2  0.963477  1.406088 -0.304026  0.849619
0 -1.282099 -0.498678       NaN  0.158885
1 -0.587665  1.014572       NaN -0.319057

# Reshaping & Pivoting in Pandas

In [46]:
data=pd.DataFrame(
    np.arange(16).reshape(4,4),
    index=[list("aabb"),[1,2]*2],
    columns=[["num","num",
              "comp","comp"],
             ["math","stat"]*2])
data

NameError: name 'np' is not defined

In [ ]:
data.index.names=["class","exam"]
data.columns.names=["field","lesson"]
data

field       num      comp
lesson     math stat math stat
class exam
a     1       0    1    2    3
      2       4    5    6    7
b     1       8    9   10   11
      2      12   13   14   15

In [ ]:
long=data.stack() # from inner level

In [ ]:
long

field              comp  num
class exam lesson
a     1    math       2    0
           stat       3    1
      2    math       6    4
           stat       7    5
b     1    math      10    8
           stat      11    9
      2    math      14   12
           stat      15   13

In [ ]:
long.unstack()

field      comp       num
lesson     math stat math stat
class exam
a     1       2    3    0    1
      2       6    7    4    5
b     1      10   11    8    9
      2      14   15   12   13

In [ ]:
data.stack(level=0)

lesson            math  stat
class exam field
a     1    comp      2     3
           num       0     1
      2    comp      6     7
           num       4     5
b     1    comp     10    11
           num       8     9
      2    comp     14    15
           num      12    13

In [ ]:
data.stack(0)

lesson            math  stat
class exam field
a     1    comp      2     3
           num       0     1
      2    comp      6     7
           num       4     5
b     1    comp     10    11
           num       8     9
      2    comp     14    15
           num      12    13

In [ ]:
data.stack("field")

lesson            math  stat
class exam field
a     1    comp      2     3
           num       0     1
      2    comp      6     7
           num       4     5
b     1    comp     10    11
           num       8     9
      2    comp     14    15
           num      12    13

In [ ]:
s1=pd.Series(
    np.arange(4),index=list("abcd"))
s2=pd.Series(
    np.arange(6,9),index=list("cde"))

In [ ]:
print(s1)
print(s2)

a    0
b    1
c    2
d    3
dtype: int32
c    6
d    7
e    8
dtype: int32

In [ ]:
data2=pd.concat([s1,s2],keys=["bir","iki"])
print(type(data2))
data2

<class 'pandas.core.series.Series'>

bir  a    0
     b    1
     c    2
     d    3
iki  c    6
     d    7
     e    8
dtype: int32

In [ ]:
data2.unstack()

       a    b    c    d    e
bir  0.0  1.0  2.0  3.0  NaN
iki  NaN  NaN  6.0  7.0  8.0

In [ ]:
data2.unstack().stack(dropna=False)

bir  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
iki  a    NaN
     b    NaN
     c    6.0
     d    7.0
     e    8.0
dtype: float64

In [ ]:
data2.unstack().stack(dropna=True)

bir  a    0.0
     b    1.0
     c    2.0
     d    3.0
iki  c    6.0
     d    7.0
     e    8.0
dtype: float64

## Pivoting “Long” to “Wide” Format

**PIVOT**

In [48]:
stock=pd.DataFrame(
    {"fruit": ["apple", "plum","grape"],
     "color": ["purple","yellow","green"],
     "piece":[3,4,5,]})

In [49]:
stock

   fruit   color  piece
0  apple  purple      3
1   plum  yellow      4
2  grape   green      5

In [55]:
stock.pivot(index="fruit", columns="color", values="piece")

color  green  purple  yellow
fruit
apple    NaN     3.0     NaN
grape    5.0     NaN     NaN
plum     NaN     NaN     4.0

In [51]:
stock["value"]=np.random.randn(len(stock))

NameError: name 'np' is not defined

In [46]:
stock

   fruit   color  piece
0  apple  purple      3
1   plum  yellow      4
2  grape   green      5
3  apple  purple      6
4   plum  yellow      1
5  grape   green      2

In [52]:
p=stock.pivot("fruit","color")
p

      piece
color green purple yellow
fruit
apple   NaN    3.0    NaN
grape   5.0    NaN    NaN
plum    NaN    NaN    4.0

In [56]:
p["value"]

KeyError: 'value'

In [ ]:
p['value'][['purple']]

color    purple
fruit
apple  1.872991
grape  0.519563
plum   0.840381

## Pivoting “Wide” to “Long” Format

**UNPIVOT**

In [58]:
data=pd.DataFrame(
    {"lesson":["math","stat","bio"],
     "Sam":[50,60,70],
     "Kim":[80,70,90],
     "Tom":[60,70,85]})
data

  lesson  Sam  Kim  Tom
0   math   50   80   60
1   stat   60   70   70
2    bio   70   90   85

In [61]:
group=pd.melt(data,["lesson"])

In [62]:
group

  lesson variable  value
0   math      Sam     50
1   stat      Sam     60
2    bio      Sam     70
3   math      Kim     80
4   stat      Kim     70
5    bio      Kim     90
6   math      Tom     60
7   stat      Tom     70
8    bio      Tom     85

In [ ]:
data=group.pivot(
    "lesson","variable","value")
data

variable  Kim  Sam  Tom
lesson
bio        90   70   85
math       80   50   60
stat       70   60   70

In [ ]:
data.reset_index()

variable lesson  Kim  Sam  Tom
0           bio   90   70   85
1          math   80   50   60
2          stat   70   60   70

# What is Groupby in Pandas?

In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame(
    {"key1":list("aabbab"),
     "key2":["one","two","three"]*2,
     "data1":np.random.randn(6),
     "data2":np.random.randn(6)})
df

  key1   key2     data1     data2
0    a    one  0.302546  0.813030
1    a    two -0.188628 -0.645688
2    b  three -0.652031  1.043208
3    b    one  0.627388 -0.774521
4    a    two -0.229404  1.423231
5    b  three  0.492783 -0.187293

In [ ]:
group=df["data1"].groupby(df["key1"])

In [ ]:
group

In [ ]:
group.mean()

key1
a   -0.044955
b    0.030618
Name: data1, dtype: float64

In [ ]:
df["data1"].groupby([df["key1"],df["key2"]]).mean()

key1  key2
a     one     -2.345915
      two      0.847860
b     one     -0.624064
      three    0.065715
Name: data1, dtype: float64

In [ ]:
df.groupby("key1").mean()

         data1     data2
key1
a    -0.216731  0.427574
b    -0.164211 -0.083191

In [ ]:
df.groupby(["key1","key2"]).mean()

               data1     data2
key1 key2
a    one   -2.345915  1.034066
     two    0.847860  0.124327
b    one   -0.624064  0.040047
     three  0.065715 -0.144810

## Iterating over Groups

In [ ]:
for c in df.groupby("key1"):
    print('lengths : ',len(c))
    print('elements : \n',c)
    print('\n')

lengths :  2
elements :
 ('a',   key1 key2     data1     data2
0    a  one -2.345915  1.034066
1    a  two  0.944954 -0.508340
4    a  two  0.750767  0.756995)


lengths :  2
elements :
 ('b',   key1   key2     data1     data2
2    b  three  0.042226 -0.232911
3    b    one -0.624064  0.040047
5    b  three  0.089205 -0.056709)

In [ ]:
for name, group in df.groupby("key1"):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one -2.345915  1.034066
1    a  two  0.944954 -0.508340
4    a  two  0.750767  0.756995
b
  key1   key2     data1     data2
2    b  three  0.042226 -0.232911
3    b    one -0.624064  0.040047
5    b  three  0.089205 -0.056709

In [ ]:
for (x1,x2),group in df.groupby(["key1",
                                 "key2"]):
    print(x1, x2)
    print(group)
    print('\n')

a one
  key1 key2     data1     data2
0    a  one -2.345915  1.034066


a two
  key1 key2     data1     data2
1    a  two  0.944954 -0.508340
4    a  two  0.750767  0.756995


b one
  key1 key2     data1     data2
3    b  one -0.624064  0.040047


b three
  key1   key2     data1     data2
2    b  three  0.042226 -0.232911
5    b  three  0.089205 -0.056709

In [ ]:
piece=dict(list(df.groupby("key1")))
piece

{'a':   key1 key2     data1     data2
 0    a  one -2.345915  1.034066
 1    a  two  0.944954 -0.508340
 4    a  two  0.750767  0.756995,
 'b':   key1   key2     data1     data2
 2    b  three  0.042226 -0.232911
 3    b    one -0.624064  0.040047
 5    b  three  0.089205 -0.056709}

In [ ]:
piece["a"]

  key1 key2     data1     data2
0    a  one -2.345915  1.034066
1    a  two  0.944954 -0.508340
4    a  two  0.750767  0.756995

## Selecting a Column or Subset of Columns

In [5]:
df.groupby(['key1', 
            'key2'])['data1'].mean()

key1  key2
a     one      0.302546
      two     -0.209016
b     one      0.627388
      three   -0.079624
Name: data1, dtype: float64

## Grouping with Dicts and Series

In [ ]:
fruit=pd.DataFrame(np.random.randn(4,4),
                   columns=list("abcd"),
                   index=["apple","cherry",
                          "banana","kiwi"])
fruit

               a         b         c         d
apple   0.910113  1.291651  0.063625 -0.962420
cherry  0.281028 -1.593991  0.516524 -0.046396
banana  0.259412 -0.210577  1.362555  0.392568
kiwi   -0.331985 -0.198729  1.246805 -0.114275

In [ ]:
label={"a": "green","b":"yellow",
       "c":"purple","d":"yellow",
       "f":"red"}

In [ ]:
group=fruit.groupby(label,axis=1)

In [ ]:
group.sum()

           green    purple    yellow
apple   0.910113  0.063625  0.329231
cherry  0.281028  0.516524 -1.640387
banana  0.259412  1.362555  0.181991
kiwi   -0.331985  1.246805 -0.313004

In [ ]:
s=pd.Series(label)
s

a     green
b    yellow
c    purple
d    yellow
f       red
dtype: object

In [ ]:
fruit

               a         b         c         d
apple   0.910113  1.291651  0.063625 -0.962420
cherry  0.281028 -1.593991  0.516524 -0.046396
banana  0.259412 -0.210577  1.362555  0.392568
kiwi   -0.331985 -0.198729  1.246805 -0.114275

In [ ]:
fruit.groupby(s,axis=1).count()

        green  purple  yellow
apple       1       1       2
cherry      1       1       2
banana      1       1       2
kiwi        1       1       2

## Grouping with Functions

In [ ]:
fruit

               a         b         c         d
apple   0.910113  1.291651  0.063625 -0.962420
cherry  0.281028 -1.593991  0.516524 -0.046396
banana  0.259412 -0.210577  1.362555  0.392568
kiwi   -0.331985 -0.198729  1.246805 -0.114275

In [ ]:
for x, j in fruit.groupby(len):
    print(x)

4
5
6

In [ ]:
fruit.groupby(len)[['a']].sum()

          a
4 -0.331985
5  0.910113
6  0.540440

## Grouping by Index Levels

In [6]:
data=pd.DataFrame(np.random.randn(4,5),
                  columns=[list("AAABB"),
                           [1,2,3,1,2]])

In [7]:
data.columns.names=["letter","number"]
data

letter         A                             B
number         1         2         3         1         2
0       1.395245 -0.485301  2.260369  0.187820  0.885485
1      -0.304363 -0.656414  0.114846 -1.775829  0.226969
2       0.673317 -0.637487  0.420948  0.447857 -0.356547
3      -1.895430  0.945116 -1.796955  1.259130  0.569983

In [ ]:
data.groupby(level="letter",axis=1).sum()

letter         A         B
0      -0.717516  1.939817
1       1.415756  1.361627
2      -3.947909 -3.025115
3       0.961580 -3.206562

# Working with GroupBy

In [ ]:
import pandas as pd
import numpy as np

In [11]:
df=pd.DataFrame({"key":list("ABC")*2,
                 "data1":range(6),
                 "data2":np.arange(5,11)})

In [9]:
df

  key1   key2     data1     data2
0    a    one  0.302546  0.813030
1    a    two -0.188628 -0.645688
2    b  three -0.652031  1.043208
3    b    one  0.627388 -0.774521
4    a    two -0.229404  1.423231
5    b  three  0.492783 -0.187293

In [12]:
group=df.groupby("key")

In [13]:
group.aggregate([np.min,np.median,"max"])

    data1            data2
     amin median max  amin median max
key
A       0    1.5   3     5    6.5   8
B       1    2.5   4     6    7.5   9
C       2    3.5   5     7    8.5  10

In [ ]:
group.agg({"data1":"min","data2":"max"})

     data1  data2
key
A        0      8
B        1      9
C        2     10

In [ ]:
def f(x):
    return x.max()-x.min()

In [ ]:
group.agg(f)

     data1  data2
key
A        3      3
B        3      3
C        3      3

## Applying a Function

In [ ]:
df=pd.DataFrame(
    np.random.randn(4,3),
    columns=list("ABC"),
    index=["Kim","Susan","Tim","Tom"])
df

              A         B         C
Kim    0.676129  0.435075 -1.436887
Susan -1.240215  0.037044  0.177536
Tim   -1.663935  2.395433 -2.227222
Tom    0.633274 -0.368660  1.068294

In [ ]:
np.abs(df)

              A         B         C
Kim    0.676129  0.435075  1.436887
Susan  1.240215  0.037044  0.177536
Tim    1.663935  2.395433  2.227222
Tom    0.633274  0.368660  1.068294

In [ ]:
df**2

              A         B         C
Kim    0.457151  0.189290  2.064643
Susan  1.538134  0.001372  0.031519
Tim    2.768679  5.738099  4.960518
Tom    0.401036  0.135910  1.141253

In [ ]:
def f(x):
    return x**2

In [ ]:
df.apply(f)

              A         B         C
Kim    0.457151  0.189290  2.064643
Susan  1.538134  0.001372  0.031519
Tim    2.768679  5.738099  4.960518
Tom    0.401036  0.135910  1.141253

In [ ]:
df

              A         B         C
Kim    0.676129  0.435075 -1.436887
Susan -1.240215  0.037044  0.177536
Tim   -1.663935  2.395433 -2.227222
Tom    0.633274 -0.368660  1.068294

In [ ]:
f = lambda x:x.max()-x.min()

In [ ]:
df.apply(f) # columnwise

A    2.340064
B    2.764093
C    3.295516
dtype: float64

In [ ]:
df.apply(f,axis=1) # rowwise

Kim      2.113016
Susan    1.417751
Tim      4.622655
Tom      1.436955
dtype: float64

## Applying more than one function

In [ ]:
data=pd.DataFrame({"letter":list("ABC")*4,
                   "num":["one","two"]*6,
                   "d1":np.random.randn(12),
                   "d2":np.arange(10,33,2)})

In [ ]:
data

   letter  num        d1  d2
0       A  one -1.145079  10
1       B  two  1.315442  12
2       C  one  1.243128  14
3       A  two  0.362978  16
4       B  one  0.647837  18
5       C  two -0.724238  20
6       A  one  0.388556  22
7       B  two  0.237648  24
8       C  one -0.950131  26
9       A  two -0.755760  28
10      B  one -0.633538  30
11      C  two  0.062815  32

In [ ]:
group=data.groupby(["letter","num"])

In [ ]:
group_d1=group["d1"]

In [ ]:
group_d1.agg("mean")

letter  num
A       one   -0.378261
        two   -0.196391
B       one    0.007149
        two    0.776545
C       one    0.146499
        two   -0.330711
Name: d1, dtype: float64

In [ ]:
#group_d1.agg(["mean","std",f])

In [ ]:
group_d1.agg([("f_mean","mean"),("f_std",np.std)])

              f_mean     f_std
letter num
A      one -0.378261  1.084444
       two -0.196391  0.791067
B      one  0.007149  0.906069
       two  0.776545  0.762116
C      one  0.146499  1.550868
       two -0.330711  0.556531

In [ ]:
group.agg({"d1":[('f_count',"count"),"max","mean"],
           "d2":"sum"})

                d1                      d2
           f_count       max      mean sum
letter num
A      one       2  0.388556 -0.378261  32
       two       2  0.362978 -0.196391  44
B      one       2  0.647837  0.007149  48
       two       2  1.315442  0.776545  36
C      one       2  1.243128  0.146499  40
       two       2  0.062815 -0.330711  52

In [ ]:
data

   letter  num        d1  d2
0       A  one -1.145079  10
1       B  two  1.315442  12
2       C  one  1.243128  14
3       A  two  0.362978  16
4       B  one  0.647837  18
5       C  two -0.724238  20
6       A  one  0.388556  22
7       B  two  0.237648  24
8       C  one -0.950131  26
9       A  two -0.755760  28
10      B  one -0.633538  30
11      C  two  0.062815  32

In [ ]:
data.groupby(["letter","num"],as_index=False).mean()

  letter  num        d1    d2
0      A  one  1.216223  16.0
1      A  two  0.579657  22.0
2      B  one -0.103406  24.0
3      B  two -0.384910  18.0
4      C  one -0.267845  20.0
5      C  two  1.251997  26.0

## Split-Apply-Combine

In [ ]:
data

   letter  num        d1  d2
0       A  one -1.145079  10
1       B  two  1.315442  12
2       C  one  1.243128  14
3       A  two  0.362978  16
4       B  one  0.647837  18
5       C  two -0.724238  20
6       A  one  0.388556  22
7       B  two  0.237648  24
8       C  one -0.950131  26
9       A  two -0.755760  28
10      B  one -0.633538  30
11      C  two  0.062815  32

In [ ]:
group=data.groupby("letter")

In [ ]:
group["d2"].apply(lambda x:x.describe())

letter
A       count     4.000000
        mean     19.000000
        std       7.745967
        min      10.000000
        25%      14.500000
        50%      19.000000
        75%      23.500000
        max      28.000000
B       count     4.000000
        mean     21.000000
        std       7.745967
        min      12.000000
        25%      16.500000
        50%      21.000000
        75%      25.500000
        max      30.000000
C       count     4.000000
        mean     23.000000
        std       7.745967
        min      14.000000
        25%      18.500000
        50%      23.000000
        75%      27.500000
        max      32.000000
Name: d2, dtype: float64

In [ ]:
math=pd.DataFrame({"Class":list("AB")*3,
                   "Stu":["Kim","Sam",
                          "Tim","Tom","John","Kate"],
                   "Score":[60,70,np.nan,
                            55,np.nan,80]})
math

  Class   Stu  Score
0     A   Kim   60.0
1     B   Sam   70.0
2     A   Tim    NaN
3     B   Tom   55.0
4     A  John    NaN
5     B  Kate   80.0

In [ ]:
group=math.groupby("Class")

In [ ]:
group.mean()

           Score
Class
A      60.000000
B      68.333333

In [ ]:
func=lambda f:f.fillna(f.mean())

In [ ]:
group.apply(func)

C:\Users\a.mammadov\AppData\Local\Temp\ipykernel_14508\2055239539.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  func=lambda f:f.fillna(f.mean())

        Class   Stu  Score
Class
A     0     A   Kim   60.0
      2     A   Tim   60.0
      4     A  John   60.0
B     1     B   Sam   70.0
      3     B   Tom   55.0
      5     B  Kate   80.0

In [ ]:
value={"A":100,"B":50}

In [ ]:
func1=lambda f:f.fillna(value[f.name])

In [ ]:
group.apply(func1)

  Class   Stu  Score
0     A   Kim   60.0
1     B   Sam   70.0
2     A   Tim  100.0
3     B   Tom   55.0
4     A  John  100.0
5     B  Kate   80.0

In [ ]:
group.mean()

           Score
Class
A      60.000000
B      68.333333

# Part 3

# Pivot Tables

In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame(
    {"class":list("ABC")*4,
     "lesson":["math","stat"]*6,
     "sex":list("MFMM")*3,
     "sibling":[1,2,3]*4,
     "score":np.arange(40,100,5)})

In [ ]:
df

   class lesson sex  sibling  score
0      A   math   M        1     40
1      B   stat   F        2     45
2      C   math   M        3     50
3      A   stat   M        1     55
4      B   math   M        2     60
5      C   stat   F        3     65
6      A   math   M        1     70
7      B   stat   M        2     75
8      C   math   M        3     80
9      A   stat   F        1     85
10     B   math   M        2     90
11     C   stat   M        3     95

In [ ]:
df.groupby("lesson")["score"].mean()

lesson
math    65.0
stat    70.0
Name: score, dtype: float64

In [3]:
df.groupby(
    ["lesson",
     "class"])[
    "score"].mean().unstack()

class      A     B     C
lesson
math    55.0  75.0  65.0
stat    70.0  60.0  80.0

In [ ]:
df.pivot_table(
    "score",
    index="lesson",
    columns="class")

class    A   B   C
lesson
math    55  75  65
stat    70  60  80

In [ ]:
df.pivot_table(
    ["sibling","score"],
    index=["class","lesson"],
    columns="sex")

             score       sibling
sex              F     M       F    M
class lesson
A     math     NaN  55.0     NaN  1.0
      stat    85.0  55.0     1.0  1.0
B     math     NaN  75.0     NaN  2.0
      stat    45.0  75.0     2.0  2.0
C     math     NaN  65.0     NaN  3.0
      stat    65.0  95.0     3.0  3.0

In [ ]:
df.pivot_table(
    ["sibling","score"],
    index=["class","lesson"],
    columns="sex",margins=True)

             score                  sibling
sex              F          M   All       F    M  All
class lesson
A     math     NaN  55.000000  55.0     NaN  1.0  1.0
      stat    85.0  55.000000  70.0     1.0  1.0  1.0
B     math     NaN  75.000000  75.0     NaN  2.0  2.0
      stat    45.0  75.000000  60.0     2.0  2.0  2.0
C     math     NaN  65.000000  65.0     NaN  3.0  3.0
      stat    65.0  95.000000  80.0     3.0  3.0  3.0
All           65.0  68.333333  67.5     2.0  2.0  2.0

In [ ]:
df.pivot_table(
    ["sibling","score"],
    index=["class","lesson"],
    columns="sex",fill_value=0)

             score     sibling
sex              F   M       F  M
class lesson
A     math       0  55       0  1
      stat      85  55       1  1
B     math       0  75       0  2
      stat      45  75       2  2
C     math       0  65       0  3
      stat      65  95       3  3

## Multi-level pivot tables

In [4]:
sib=pd.cut(df["sibling"],[0,2,3])

In [5]:
df.pivot_table("score",
               ["lesson",sib],
               "class",fill_value=0)

class            A   B   C
lesson sibling
math   (0, 2]   55  75   0
       (2, 3]    0   0  65
stat   (0, 2]   70  60   0
       (2, 3]    0   0  80

In [6]:
df.pivot_table(
    "score",
    index="lesson",
    columns="class")

class    A   B   C
lesson
math    55  75  65
stat    70  60  80

In [12]:
df.pivot_table(index=["lesson","sex"],columns="class",aggfunc="sum")

           score           sibling
class          A    B    C       A  B  C
lesson sex
math   M     110  150  130       2  4  6
stat   F      85   45   65       1  2  3
       M      55   75   95       1  2  3

In [8]:
df

   class lesson sex  sibling  score
0      A   math   M        1     40
1      B   stat   F        2     45
2      C   math   M        3     50
3      A   stat   M        1     55
4      B   math   M        2     60
5      C   stat   F        3     65
6      A   math   M        1     70
7      B   stat   M        2     75
8      C   math   M        3     80
9      A   stat   F        1     85
10     B   math   M        2     90
11     C   stat   M        3     95

In [ ]:
df.pivot_table(
    index="lesson",
    columns="class",
    aggfunc={"sibling":"max",
             "score":"sum"})

       score           sibling
class      A    B    C       A  B  C
lesson
math     110  150  130       1  2  3
stat     140  120  160       1  2  3

## Cross-Tabulations: Crosstab

In [ ]:
pd.crosstab(df.sibling,df.lesson)

lesson   math  stat
sibling
1           2     2
2           2     2
3           2     2

In [ ]:
pd.crosstab([df.sibling, df.lesson], df.sex)

sex             F  M
sibling lesson
1       math    0  2
        stat    1  1
2       math    0  2
        stat    1  1
3       math    0  2
        stat    1  1

# Categorical Data in Pandas

## Categorical Type in Pandas

In [ ]:
data

   letter  num        d1  d2
0       A  one  2.351006  10
1       B  two  0.797880  12
2       C  one -0.322245  14
3       A  two  0.972293  16
4       B  one  1.258925  18
5       C  two  0.311241  20
6       A  one  0.081440  22
7       B  two -1.567699  24
8       C  one -0.213444  26
9       A  two  0.187022  28
10      B  one -1.465737  30
11      C  two  2.192753  32

In [ ]:
N=len(data)
N

5

In [ ]:
df=pd.DataFrame(
    {"name":data,
     "num":np.arange(N),
     "score":np.random.randint(40,100,size=N),
     "weight":np.random.uniform(50,70,size=N)},
    columns=["num","name","score","weight"])

In [ ]:
df

   num   name  score     weight
0    0    tim     43  60.241107
1    1   Kate     48  51.109875
2    2  SUSan     49  64.458910
3    3    NaN     43  66.906040
4    4   aLEX     92  50.966198

In [ ]:
df["name"]

0      tim
1     Kate
2    SUSan
3      NaN
4     aLEX
Name: name, dtype: object

In [ ]:
type(df["name"])

pandas.core.series.Series

In [ ]:
name_cat=df["name"].astype("category")
name_cat

0      tim
1     Kate
2    SUSan
3      NaN
4     aLEX
Name: name, dtype: category
Categories (4, object): ['Kate', 'SUSan', 'aLEX', 'tim']

In [14]:
x=name_cat.values
x

NameError: name 'name_cat' is not defined

In [ ]:
x.categories

Index(['Kate', 'SUSan', 'aLEX', 'tim'], dtype='object')

In [ ]:
x.codes

array([ 3,  0,  1, -1,  2], dtype=int8)

In [ ]:
df["name"]=df["name"].astype("category")
df.name

0      tim
1     Kate
2    SUSan
3      NaN
4     aLEX
Name: name, dtype: category
Categories (4, object): ['Kate', 'SUSan', 'aLEX', 'tim']

In [ ]:
data_cat=pd.Categorical(list("abcde"))
data_cat

['a', 'b', 'c', 'd', 'e']
Categories (5, object): ['a', 'b', 'c', 'd', 'e']

In [ ]:
pd.Categorical(["banana", "apple", 
                "kiwi", "banana", "apple"])

['banana', 'apple', 'kiwi', 'banana', 'apple']
Categories (3, object): ['apple', 'banana', 'kiwi']

In [ ]:
people=["baby", "child", "young", "old"]
codes=[0,1,2,3,1,0,0]
people_cat=pd.Categorical.from_codes(
    codes,people)
people_cat

['baby', 'child', 'young', 'old', 'child', 'baby', 'baby']
Categories (4, object): ['baby', 'child', 'young', 'old']

In [ ]:
people_cat=pd.Categorical.from_codes(
    codes,people,ordered=True)
people_cat

['baby', 'child', 'young', 'old', 'child', 'baby', 'baby']
Categories (4, object): ['baby' < 'child' < 'young' < 'old']

In [ ]:
people_cat.as_ordered()

['baby', 'child', 'young', 'old', 'child', 'baby', 'baby']
Categories (4, object): ['baby' < 'child' < 'young' < 'old']

## Working with Categorical

In [ ]:
data=np.random.randn(1000)

In [ ]:
interval=pd.qcut(data,4)
interval

[(-3.7079999999999997, -0.628], (-0.628, 0.0263], (0.701, 3.267], (0.701, 3.267], (-0.628, 0.0263], ..., (-3.7079999999999997, -0.628], (0.701, 3.267], (0.0263, 0.701], (-3.7079999999999997, -0.628], (-0.628, 0.0263]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.7079999999999997, -0.628] < (-0.628, 0.0263] < (0.0263, 0.701] < (0.701, 3.267]]

In [ ]:
type(interval)

pandas.core.arrays.categorical.Categorical

In [ ]:
interval=pd.qcut(data,4,labels=["Q1","Q2",
                                "Q3","Q4"])
interval

['Q1', 'Q2', 'Q4', 'Q4', 'Q2', ..., 'Q1', 'Q4', 'Q3', 'Q1', 'Q2']
Length: 1000
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [ ]:
interval=pd.Series(interval,name="quarter")

In [ ]:
pd.Series(
    data).groupby(
    interval).agg(["count",
                   "min",
                   "max"]).reset_index()

  quarter  count       min       max
0      Q1    250 -3.707009 -0.633792
1      Q2    250 -0.626227  0.025228
2      Q3    250  0.027349  0.700024
3      Q4    250  0.703021  3.267141

## 3- How is the performance of categorical types?

In [ ]:
N=10000000
num=pd.Series(np.random.randn(N))

In [ ]:
label=pd.Series(["a","b","c","d"]*(N//4))

In [ ]:
cat=label.astype("category")

In [ ]:
label.memory_usage()

80000128

In [ ]:
cat.memory_usage()

10000332

## 4- What are categorical methods?

In [ ]:
s=pd.Series(["a","b","c","d"]*2)

In [ ]:
s_ct=s.astype("category")
s_ct

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [ ]:
s_ct.cat.codes

0    0
1    1
2    2
3    3
4    0
5    1
6    2
7    3
dtype: int8

In [ ]:
s_ct.cat.categories

Index(['a', 'b', 'c', 'd'], dtype='object')

In [ ]:
new_ct=["a","b","c","d","e"]
s_ct.cat.set_categories(new_ct)

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (5, object): ['a', 'b', 'c', 'd', 'e']

In [ ]:
s2_ct=s_ct[s_ct.isin(["a","b"])]
s2_ct

0    a
1    b
4    a
5    b
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [ ]:
s2_ct.cat.remove_unused_categories()

0    a
1    b
4    a
5    b
dtype: category
Categories (2, object): ['a', 'b']

## 5- How to create a dummy variable?

In [ ]:
s_ct

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [ ]:
pd.get_dummies(s_ct)

   a  b  c  d
0  1  0  0  0
1  0  1  0  0
2  0  0  1  0
3  0  0  0  1
4  1  0  0  0
5  0  1  0  0
6  0  0  1  0
7  0  0  0  1

# Working with Text Data

In [ ]:
"hello".upper()

'HELLO'

## Vectorized String Functions

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
data=["tim","Kate","SUSan",np.nan,"aLEX"]

In [ ]:
name=pd.Series(data)

In [ ]:
name.str.capitalize()

0      Tim
1     Kate
2    Susan
3      NaN
4     Alex
dtype: object

In [ ]:
name.str.lower()

0      tim
1     kate
2    susan
3      NaN
4     alex
dtype: object

In [ ]:
name.str.len()

0    3.0
1    4.0
2    5.0
3    NaN
4    4.0
dtype: float64

In [ ]:
name.str.startswith("a")

0    False
1    False
2    False
3      NaN
4     True
dtype: object

In [ ]:
df=pd.DataFrame(
    np.random.randn(3,2),
    columns=["Column A","Column B"],
    index=range(3))
df

   Column A  Column B
0  1.146440  1.611199
1  0.755113 -1.662844
2  0.907902  1.176211

In [ ]:
df.columns

Index(['Column A', 'Column B'], dtype='object')

In [ ]:
df.columns.str.lower().str.replace(" ","_")

Index(['column_a', 'column_b'], dtype='object')

In [ ]:
s=pd.Series(["a_b_c","c_d_e",np.nan,"f_g_h"])
s

0    a_b_c
1    c_d_e
2      NaN
3    f_g_h
dtype: object

In [ ]:
s.str.split("_").str[1]

0      b
1      d
2    NaN
3      g
dtype: object

In [ ]:
s.str.split("_",expand=True,n=1)

     0    1
0    a  b_c
1    c  d_e
2  NaN  NaN
3    f  g_h

In [ ]:
money=pd.Series(["15","-$20","$30000"])
money

0        15
1      -$20
2    $30000
dtype: object

In [ ]:
money.str.replace("-\$","")

C:\Users\ramazanovnf\AppData\Local\Temp/ipykernel_12200/2480055249.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  money.str.replace("-\$","")

0        15
1        20
2    $30000
dtype: object

In [ ]:
money.str.replace("-\$","-")

C:\Users\ramazanovnf\AppData\Local\Temp/ipykernel_12200/3340069485.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  money.str.replace("-\$","-")

0        15
1       -20
2    $30000
dtype: object

You can use google or pandas.pydata.org to see the string methods of Pandas documentation.

In [22]:
import pandas as pd
film=pd.read_csv("http://bit.ly/imdbratings")
film

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."
...,...,...,...,...,...,...
974,7.4,Tootsie,PG,Comedy,116,"[u'Dustin Hoffman', u'Jessica Lange', u'Teri G..."
975,7.4,Back to the Future Part III,PG,Adventure,118,"[u'Michael J. Fox', u'Christopher Lloyd', u'Ma..."
976,7.4,Master and Commander: The Far Side of the World,PG-13,Action,138,"[u'Russell Crowe', u'Paul Bettany', u'Billy Bo..."
977,7.4,Poltergeist,PG,Horror,114,"[u'JoBeth Williams', u""Heather O'Rourke"", u'Cr..."
978,7.4,Wall Street,R,Crime,126,"[u'Charlie Sheen', u'Michael Douglas', u'Tamar..."

In [29]:
film["actors_list"].str.replace("u'","",regex=True).str.replace("[[]","",regex=True).str.replace("]","")

C:\Users\User\AppData\Local\Temp\ipykernel_5808\561179745.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  film["actors_list"].str.replace("u'","",regex=True).str.replace("[[]","",regex=True).str.replace("]","")

0             Tim Robbins', Morgan Freeman', Bob Gunton'
1                Marlon Brando', Al Pacino', James Caan'
2            Al Pacino', Robert De Niro', Robert Duvall'
3         Christian Bale', Heath Ledger', Aaron Eckhart'
4       John Travolta', Uma Thurman', Samuel L. Jackson'
                             ...
974          Dustin Hoffman', Jessica Lange', Teri Garr'
975    Michael J. Fox', Christopher Lloyd', Mary Stee...
976           Russell Crowe', Paul Bettany', Billy Boyd'
977    JoBeth Williams', u"Heather O'Rourke", Craig T...
978      Charlie Sheen', Michael Douglas', Tamara Tunie'
Name: actors_list, Length: 979, dtype: object

In [ ]:
film.title.str.upper()

0                             THE SHAWSHANK REDEMPTION
1                                        THE GODFATHER
2                               THE GODFATHER: PART II
3                                      THE DARK KNIGHT
4                                         PULP FICTION
                            ...
974                                            TOOTSIE
975                        BACK TO THE FUTURE PART III
976    MASTER AND COMMANDER: THE FAR SIDE OF THE WORLD
977                                        POLTERGEIST
978                                        WALL STREET
Name: title, Length: 979, dtype: object

In [ ]:
film.columns=film.columns.str.capitalize()

In [ ]:
film.head()

,Star_rating,Title,Content_rating,Genre,Duration,Actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [ ]:
film[film.Actors_list.str.contains(
    "Brad Pitt")]

,Star_rating,Title,Content_rating,Genre,Duration,Actors_list
9,8.9,Fight Club,R,Drama,139,"[u'Brad Pitt', u'Edward Norton', u'Helena Bonh..."
24,8.7,Se7en,R,Drama,127,"[u'Morgan Freeman', u'Brad Pitt', u'Kevin Spac..."
106,8.3,Snatch.,R,Comedy,102,"[u'Jason Statham', u'Brad Pitt', u'Benicio Del..."
114,8.3,Inglourious Basterds,R,Adventure,153,"[u'Brad Pitt', u'Diane Kruger', u'Eli Roth']"
264,8.1,Twelve Monkeys,R,Mystery,129,"[u'Bruce Willis', u'Madeleine Stowe', u'Brad P..."
508,7.8,The Curious Case of Benjamin Button,PG-13,Drama,166,"[u'Brad Pitt', u'Cate Blanchett', u'Tilda Swin..."
577,7.8,Ocean's Eleven,PG-13,Crime,116,"[u'George Clooney', u'Brad Pitt', u'Julia Robe..."
683,7.7,Fury,R,Action,134,"[u'Brad Pitt', u'Shia LaBeouf', u'Logan Lerman']"
776,7.6,Moneyball,PG-13,Biography,133,"[u'Brad Pitt', u'Robin Wright', u'Jonah Hill']"
779,7.6,Interview with the Vampire: The Vampire Chroni...,R,Horror,123,"[u'Brad Pitt', u'Tom Cruise', u'Antonio Bander..."
807,7.6,The Assassination of Jesse James by the Coward...,R,Biography,160,"[u'Brad Pitt', u'Casey Affleck', u'Sam Shepard']"
826,7.5,Sleepers,R,Crime,147,"[u'Robert De Niro', u'Kevin Bacon', u'Brad Pitt']"
877,7.5,Legends of the Fall,R,Drama,133,"[u'Brad Pitt', u'Anthony Hopkins', u'Aidan Qui..."
901,7.5,Babel,R,Drama,143,"[u'Brad Pitt', u'Cate Blanchett', u'Gael Garc\..."

In [ ]:
film.Actors_list.str.replace("[","")

C:\Users\ramazanovnf\AppData\Local\Temp/ipykernel_12200/3981671177.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  film.Actors_list.str.replace("[","")

0      u'Tim Robbins', u'Morgan Freeman', u'Bob Gunton']
1         u'Marlon Brando', u'Al Pacino', u'James Caan']
2      u'Al Pacino', u'Robert De Niro', u'Robert Duva...
3      u'Christian Bale', u'Heath Ledger', u'Aaron Ec...
4      u'John Travolta', u'Uma Thurman', u'Samuel L. ...
                             ...
974    u'Dustin Hoffman', u'Jessica Lange', u'Teri Ga...
975    u'Michael J. Fox', u'Christopher Lloyd', u'Mar...
976    u'Russell Crowe', u'Paul Bettany', u'Billy Boyd']
977    u'JoBeth Williams', u"Heather O'Rourke", u'Cra...
978    u'Charlie Sheen', u'Michael Douglas', u'Tamara...
Name: Actors_list, Length: 979, dtype: object

In [ ]:
film.Actors_list.str.replace(
    "[","").str.replace("]","")

C:\Users\ramazanovnf\AppData\Local\Temp/ipykernel_12200/2633525957.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  film.Actors_list.str.replace(

0       u'Tim Robbins', u'Morgan Freeman', u'Bob Gunton'
1          u'Marlon Brando', u'Al Pacino', u'James Caan'
2      u'Al Pacino', u'Robert De Niro', u'Robert Duvall'
3      u'Christian Bale', u'Heath Ledger', u'Aaron Ec...
4      u'John Travolta', u'Uma Thurman', u'Samuel L. ...
                             ...
974    u'Dustin Hoffman', u'Jessica Lange', u'Teri Garr'
975    u'Michael J. Fox', u'Christopher Lloyd', u'Mar...
976     u'Russell Crowe', u'Paul Bettany', u'Billy Boyd'
977    u'JoBeth Williams', u"Heather O'Rourke", u'Cra...
978    u'Charlie Sheen', u'Michael Douglas', u'Tamara...
Name: Actors_list, Length: 979, dtype: object